app/views/quiz/_list.html.erb

SELECT `puzzles`.* FROM `puzzles`
---
<%Puzzle.all.each do |t|%>