app/views/quiz/creategame.html.erb

SELECT `puzzles`.* FROM `puzzles` ORDER BY `puzzles`.`id` DESC LIMIT 1
---

<%Puzzle.last do |t| %>