app/views/quiz/form.html.erb


<%t=Question.last%>
---
SELECT `questions`.* FROM `questions` ORDER BY `questions`.`id` DESC LIMIT 1