app/views/quiz/game.html.erb

SELECT `questions`.* FROM `questions`
---
<div class="overflow">
<% Question.all.each do |t|%>