app/views/quiz/game.html.erb

<div class="game">
<%t=Question.last%>
---
SELECT `questions`.* FROM `questions` ORDER BY `questions`.`id` DESC LIMIT 1

<div class="images">
<% Question.all.each do |t|%>
---
SELECT `questions`.* FROM `questions`