app/controllers/quiz_controller.rb

  def create
    question = params[:question]
    answer = Array.new
    opt1 = params[:option1]
    answer.push(opt1)
    opt2 = params[:option2]
    answer.push(opt2)
    opt3 = params[:option3]
    answer.push(opt3)
    opt4 = params[:option4]
    answer.push(opt4)
    ans = params[:option]
    btn = params[:button]

    if answer != answer.uniq
      flash[:error] = "Duplicate Options"
    elsif ans==nil
      flash[:error] = "Choose the answer"
    else
    @quiz = Puzzle.create!(
      question: question,
      option1: opt1,
      option2: opt2,
      option3: opt3,
      option4: opt4,
      answer: ans,
      button: btn
    )
---
INSERT INTO `puzzles` (`question`, `option1`, `option2`, `option3`, `option4`, `created_at`, `updated_at`, `answer`) VALUES ('ccccccccccccccccccccccc', '111111111', '22222222222', '33333', '444444444444', '2022-07-29 08:58:12.476951', '2022-07-29 08:58:12.476951', 'd')

  def edit
    question = params[:question]
    opt1 = params[:option1]
    opt2 = params[:option2]
    opt3 = params[:option3]
    opt4 = params[:option4]
    ans = params[:option]
    btn = params[:button]
    @quiz = Puzzle.update(
      question: question,
      option1: opt1,
      option2: opt2,
      option3: opt3,
      option4: opt4,
      answer: ans,
      button: btn
    )
---
UPDATE `puzzles` SET `puzzles`.`question` = NULL, `puzzles`.`option1` = NULL, `puzzles`.`option2` = NULL, `puzzles`.`option3` = NULL, `puzzles`.`option4` = NULL, `puzzles`.`updated_at` = '2022-07-25 10:18:29.870556', `puzzles`.`answer` = NULL, `puzzles`.`button` = NULL WHERE `puzzles`.`id` = 1

  def display
    id = params[:id]
    quiz= Puzzle.find(id)
---
SELECT `puzzles`.* FROM `puzzles` WHERE `puzzles`.`id` = 1 LIMIT 1

  def show
    question = params[:kinds_of_question]
    kind_of_question = Question.create!(
      kind_of_question: question
    )
---
INSERT INTO `questions` (`kind_of_question`, `created_at`, `updated_at`) VALUES ('fillup', '2022-08-01 05:32:14.111716', '2022-08-01 05:32:14.111716')