app/controllers/session_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'swe@gamil.com' LIMIT 1
---
  def signin_handle
      user = User.find_by(email: user_params["email"])