app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `phone_no`, `password_digest`, `created_at`, `updated_at`) VALUES ('sanboi', 'santa123@gmail.com', 9876243217, '$2a$12$0ETimlQYSSSSQ581MiGQVOWt3kderxec.4prHVPqQ2PyKY8I5yk1m', '2022-07-29 07:04:41.907975', '2022-07-29 07:04:41.907975')
---
  def create
    user = User.new(user_params)
    if user.save